{
    "recent": [
        {
            "post" : {
                "title"    : "Codename Missile Command",
                "loc"      : "/codename-missile-command/",
                "category" : "coding",
                "date"     : "12th December 2014",
                "extract"  : "<div class='text-center'><img src='/coding/codename-missile-command/img/wargamescrop.png'/></div><p>For me, Ludum Dare was, unfortunately, a total non-starter. It only ruddy clashed with a wedding on the Saturday, I then got a lovely spot of seasonal flu to halt any chances of trying to smash something worthwhile out on the Sunday. However, its not over, the spirit of Ludum Dare is in the creation so I’m going to implement a couple of new rules just for myself.</p>"
            }
        },
        {
            "post" : {
                "title"    : "Jumping In",
                "loc"      : "/jumping-in/",
                "category" : "coding",
                "date"     : "23rd September 2014",
                "extract"  : "<div class='text-center'><img src='/coding/jumping-in/img/ludumdare.png'/></div><p>So, I’m going to do it. I’ve checked with Kate, she’s happy enough about it. I’m going to enter Ludum Dare this year. This is my official public announcement.</p>"
            }
        },
        {
            "post" : {
                "title"    : "Atom Beta",
                "loc"      : "/atom-beta/",
                "category" : "coding",
                "date"     : "22nd March 2014",
                "extract"  : "<p>In truth, Brackets has been pretty good to me. Despite taking some flak for it, I’ve staunchly defended a <em>browserified</em> editor and, by and large, Brackets has been a good friend.  In short, we’ve had a rather pleasing arrangement. However, that relationship may be ending very soon.</p><p>One of the latest offerings from Github is Atom, which, in it’s own words, is an editor for modern hacking.</p>"
            }
        },
        {
            "post" : {
                "title"    : "Brackets Terminal Theme",
                "loc"      : "/brackets-terminal-theme/",
                "category" : "coding",
                "date"     : "6th July 2013",
                "extract"  : "<div class='text-center'><img src='/coding/brackets-terminal-theme/img/terminal.jpg'/></div><p>Adding a custom theme or tweaking an existing theme for your own tastes using Brackets is really easy, quick and flexible.  The following short steps should help you get started shaping the look the feel of Brackets.</p><p class='readmore'><a href='/coding/brackets-terminal-theme/'>Read More</a></p>"
            }
        },
        {
            "post" : {
                "title"    : "Brackets Sprint 25",
                "loc"      : "/brackets-sprint-25/",
                "category" : "coding",
                "date"     : "30th May 2013",
                "extract"  : "<p>If you’re anything like me then you are a little choosy in what you want from your text editor or IDE.  I like a minimalist feel and I don’t really want all the extra clutter and weight you get with a dedicated and mature IDE but I want a little more than <a href='http://www.vim.org/'>vim</a> as my full-time coding environment (although I love vim).  This sounds like a job for Brackets.</p><p class='readmore'><a href='/coding/brackets-sprint-25/'>Read More</a></p>"
            }
        },
        {
            "post" : {
                "title"    : "Speed up working with arrays",
                "loc"      : "/local-variable-vs-array-access",
                "category" : "coding",
                "date"     : "8th June 2013",
                "extract"  : "<p>This is an old tip, but still a good one: when iterating over an array it is usually preferable to assign the subject of the current iteration to a local variable than it is to use array access multiple times.</p><p>I’m still a little <a href='http://www.urbandictionary.com/define.php?term=old%20school'>old school</a> and try to limit the number of local variables but there are times when doing so offers a number of benefits.</p><p class='readmore'><a href='/coding/local-variable-vs-array-access/'>Read More</a></p>"
            }
        },
        {
            "post" : {
                "title"    : "Introducing Grunt-banner",
                "loc"      : "/introducing-grunt-banner/",
                "category" : "coding",
                "date"     : "11th May 2013",
                "extract"  : "<p>Hot on the heels of <a href='https://github.com/mattstyles/grunt-booty'>grunt-booty</a> is <a href='https://github.com/mattstyles/grunt-banner'>grunt-banner</a>.  Following along the same lines of creating a quick and simple to use Grunt task, Grunt-banner simply puts some banner text at the top or bottom of a file.  Couldn’t be simpler!</p><p class='readmore'><a href='/coding/introducing-grunt-banner/'>Read More</a></p>"
            }
        },
        {
            "post" : {
                "title"    : "Introducing Grunt-booty",
                "loc"      : "/introducing-grunt-booty/",
                "category" : "coding",
                "date"     : "23rd April 2013",
                "extract"  : "<p>Grunt-booty is a grunt plugin that compiles Bower installed Bootstrap and Font-Awesome-More Less files into css that is ready to use in your Yeoman scaffolded Angular apps.</p><p class='readmore'><a href='/coding/introducing-grunt-booty/'>Read More</a></p>"
            }
        }
    ]
}
